# VS Code Extensions List
# This file tracks all extensions that should be installed in this workspace
# Format: publisher.extension-name
# Lines starting with # are comments and will be ignored
# Auto-generated by extension_manager.py

# Python Development
donjayamanne.python-environment-manager
donjayamanne.python-extension-pack
kevinrose.vsc-python-indent
mgesbert.python-path
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
tushortz.python-extended-snippets

# Git and Version Control
eamodio.gitlens
github.codespaces
github.copilot
github.copilot-chat
github.github-vscode-theme
github.vscode-pull-request-github

# Markdown
davidanson.vscode-markdownlint
yzhang.markdown-all-in-one

# General Development
batisteo.vscode-django
ms-kubernetes-tools.vscode-kubernetes-tools
redhat.vscode-yaml
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode

# Other
jebbs.plantuml
ms-vsliveshare.vsliveshare
njpwerner.autodocstring
wholroyd.jinja

